app/controllers/answers_controller.rb

  def show
    p "*" * 100
    p "*" * 100
    p "*" * 100
    p "*" * 100
    p session[:question_id] = params[:id]
    @questions = Question.find(session[:question_id])
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT 1  [["id", 1]]

  def megusta


    p @id_question
    p answer_id = params[:id]
    @answer = Answer.find(answer_id)
    @answer.update(vote_like: (@answer.vote_like + 1))
    @answer_val = Answer.all.order(:id)
---
SELECT  "answers".* FROM "answers" WHERE "answers"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "answers" SET "vote_like" = ?, "updated_at" = ? WHERE "answers"."id" = ?  [["vote_like", 4], ["updated_at", "2016-08-01 23:28:11.208304"], ["id", 1]]
SELECT "answers".* FROM "answers"  ORDER BY "answers"."id" ASC

  def medisgusta

    p "*" * 100
    p @id_question
    p answer_id = params[:id]
    @answer = Answer.find(answer_id)
    @answer.update(vote_dislike: (@answer.vote_dislike + 1))
---
SELECT  "answers".* FROM "answers" WHERE "answers"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "answers" SET "vote_dislike" = ?, "updated_at" = ? WHERE "answers"."id" = ?  [["vote_dislike", 2], ["updated_at", "2016-08-01 23:42:27.374934"], ["id", 1]]