app/controllers/questions_controller.rb

  def create

    p "**" * 100
    p question_val = params[:question][:question]
    new_question = Question.new(question: question_val, vote_like: 0, vote_dislike: 0)
    new_question.save
    @questions = Question.all
---
INSERT INTO "questions" ("vote_like", "vote_dislike", "question", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["vote_like", 0], ["vote_dislike", 0], ["question", "{\"question\"=>\"test\"}"], ["created_at", "2016-08-01 23:56:34.228670"], ["updated_at", "2016-08-01 23:56:34.228670"]]
SELECT "questions".* FROM "questions"