app/controllers/users_controller.rb

  def create
    p user_name = params[:user][:user_name]
    p mail = params[:user][:mail]
    p password = params[:user][:password]



    if logged_in?
      user = User.find_by(user_name: user_name)
      user.update(user_name: user_name, mail: mail, password: password)
      flash[:edit_message] = "Tus datos fueron editados"
      render 'index'

    else
      @user = User.new(user_name: user_name, mail: mail, password: password)
      if @user.save
---
SELECT  "users".* FROM "users" WHERE "users"."user_name" = ? LIMIT 1  [["user_name", "mau"]]
UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$10$4tqkDY6ChLK3P40MsuYJduSJGb5ucZFnOH28m4bxTu/EOFdOlWOzq"], ["updated_at", "2016-08-01 19:32:19.879721"], ["id", 1]]
INSERT INTO "users" ("user_name", "mail", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_name", "aldo"], ["mail", "aldo@aldo.com"], ["password", "a"], ["created_at", "2016-08-01 17:41:59.554356"], ["updated_at", "2016-08-01 17:41:59.554356"]]